---
title: FamilySizeTableErrorInfo
classe: Autodesk.Revit.DB.FamilySizeTableErrorInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# FamilySizeTableErrorInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FamilySizeTableErrorType FamilySizeTableErrorType { get; }` | `familySizeTableErrorInfo.FamilySizeTableErrorType` | FamilySizeTableErrorType |
| `String FilePath { get; }` | `familySizeTableErrorInfo.FilePath` | String |
| `Int32 InvalidColumnIndex { get; }` | `familySizeTableErrorInfo.InvalidColumnIndex` | Int32 |
| `String InvalidHeaderText { get; }` | `familySizeTableErrorInfo.InvalidHeaderText` | String |
| `Int32 InvalidRowIndex { get; }` | `familySizeTableErrorInfo.InvalidRowIndex` | Int32 |
| `Boolean IsValidObject { get; }` | `familySizeTableErrorInfo.IsValidObject` | Boolean |
| `Void Dispose()` | `familySizeTableErrorInfo.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```